NVIDIA/OpenSMA/src/boards/p3957/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SSD5_PERST_L_GPIO GPIO0                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_SSD5_PERST_L_INIT_GPIO_VALUE 1U        /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_SSD5_PERST_L_GPIO_PIN 23U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_SSD5_PERST_L_GPIO_PIN_MASK (1U << 23U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SSD5_PERST_L_PORT PORT0                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SSD5_PERST_L_PIN 23U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SSD5_PERST_L_PIN_MASK (1U << 23U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORT1_8 (coord A1), VPP_CPU1_SDA
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_VPP_CPU1_SDA_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_VPP_CPU1_SDA_PIN 8U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_VPP_CPU1_SDA_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PORT1_9 (coord B1), VPP_CPU1_SCL
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_VPP_CPU1_SCL_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_VPP_CPU1_SCL_PIN 9U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_VPP_CPU1_SCL_PIN_MASK (1U << 9U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PORT1_10 (coord C3), VPP_CPU1_ALERT
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_VPP_CPU1_ALERT_GPIO GPIO1                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_VPP_CPU1_ALERT_INIT_GPIO_VALUE 1U        /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_VPP_CPU1_ALERT_GPIO_PIN 10U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_VPP_CPU1_ALERT_GPIO_PIN_MASK (1U << 10U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_VPP_CPU1_ALERT_PORT PORT1                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_VPP_CPU1_ALERT_PIN 10U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_VPP_CPU1_ALERT_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                                                /* @} */

/*! @name PORT1_16 (coord F6), SSD0_PRSNT_L
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SSD0_PRSNT_L_GPIO GPIO1                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_SSD0_PRSNT_L_GPIO_PIN 16U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_SSD0_PRSNT_L_GPIO_PIN_MASK (1U << 16U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SSD0_PRSNT_L_PORT PORT1                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SSD0_PRSNT_L_PIN 16U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SSD0_PRSNT_L_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORT1_17 (coord F4), SSD1_PRSNT_L
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SSD1_PRSNT_L_GPIO GPIO1                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_SSD1_PRSNT_L_GPIO_PIN 17U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_SSD1_PRSNT_L_GPIO_PIN_MASK (1U << 17U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SSD1_PRSNT_L_PORT PORT1                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SSD1_PRSNT_L_PIN 17U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SSD1_PRSNT_L_PIN_MASK (1U << 17U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORT1_18 (coord G4), V_SSD5_DIS
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_V_SSD5_DIS_GPIO GPIO1                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_V_SSD5_DIS_INIT_GPIO_VALUE 0U        /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_V_SSD5_DIS_GPIO_PIN 18U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_V_SSD5_DIS_GPIO_PIN_MASK (1U << 18U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_V_SSD5_DIS_PORT PORT1                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_V_SSD5_DIS_PIN 18U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_V_SSD5_DIS_PIN_MASK (1U << 18U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PORT1_19 (coord G5), V_SSD6_DIS
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_V_SSD6_DIS_GPIO GPIO1                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_V_SSD6_DIS_INIT_GPIO_VALUE 0U        /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_V_SSD6_DIS_GPIO_PIN 19U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_V_SSD6_DIS_GPIO_PIN_MASK (1U << 19U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_V_SSD6_DIS_PORT PORT1                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_V_SSD6_DIS_PIN 19U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_V_SSD6_DIS_PIN_MASK (1U << 19U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PORT2_0 (coord H2), SSD4_PRSNT_L
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SSD4_PRSNT_L_GPIO GPIO2               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_SSD4_PRSNT_L_GPIO_PIN 0U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_SSD4_PRSNT_L_GPIO_PIN_MASK (1U << 0U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SSD4_PRSNT_L_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SSD4_PRSNT_L_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SSD4_PRSNT_L_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PORT2_1 (coord H1), SSD5_PRSNT_L
  @{ */

