NVIDIA/OpenSMA/src/boards/p3957/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SSD5_PRSNT_L_GPIO GPIO2               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_SSD5_PRSNT_L_GPIO_PIN 1U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_SSD5_PRSNT_L_GPIO_PIN_MASK (1U << 1U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SSD5_PRSNT_L_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SSD5_PRSNT_L_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SSD5_PRSNT_L_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PORT2_2 (coord H3), SSD6_PRSNT_L
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SSD6_PRSNT_L_GPIO GPIO2               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_SSD6_PRSNT_L_GPIO_PIN 2U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_SSD6_PRSNT_L_GPIO_PIN_MASK (1U << 2U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SSD6_PRSNT_L_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SSD6_PRSNT_L_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SSD6_PRSNT_L_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PORT2_3 (coord J3), SSD7_PRSNT_L
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SSD7_PRSNT_L_GPIO GPIO2               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_SSD7_PRSNT_L_GPIO_PIN 3U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_SSD7_PRSNT_L_GPIO_PIN_MASK (1U << 3U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SSD7_PRSNT_L_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SSD7_PRSNT_L_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SSD7_PRSNT_L_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PORT2_8 (coord M2), SSD4_LED
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SSD4_LED_GPIO GPIO2               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_SSD4_LED_GPIO_PIN 8U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_SSD4_LED_GPIO_PIN_MASK (1U << 8U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SSD4_LED_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SSD4_LED_PIN 8U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SSD4_LED_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORT2_9 (coord M1), SSD5_LED
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SSD5_LED_GPIO GPIO2               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_SSD5_LED_GPIO_PIN 9U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_SSD5_LED_GPIO_PIN_MASK (1U << 9U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SSD5_LED_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SSD5_LED_PIN 9U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SSD5_LED_PIN_MASK (1U << 9U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORT2_10 (coord M3), SSD6_LED
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SSD6_LED_GPIO GPIO2                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_SSD6_LED_GPIO_PIN 10U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_SSD6_LED_GPIO_PIN_MASK (1U << 10U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SSD6_LED_PORT PORT2                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SSD6_LED_PIN 10U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SSD6_LED_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PORT2_11 (coord N4), SSD7_LED
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SSD7_LED_GPIO GPIO2                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_SSD7_LED_GPIO_PIN 11U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_SSD7_LED_GPIO_PIN_MASK (1U << 11U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SSD7_LED_PORT PORT2                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SSD7_LED_PIN 11U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SSD7_LED_PIN_MASK (1U << 11U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PORT3_0 (coord B17), SSD0_PWRDIS
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SSD0_PWRDIS_GPIO GPIO3               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_SSD0_PWRDIS_INIT_GPIO_VALUE 0U       /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_SSD0_PWRDIS_GPIO_PIN 0U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_SSD0_PWRDIS_GPIO_PIN_MASK (1U << 0U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SSD0_PWRDIS_PORT PORT3               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SSD0_PWRDIS_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SSD0_PWRDIS_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                            /* @} */

