NVIDIA/OpenSMA/src/boards/p3957/board/pin_mux.h
/*! @name PORT3_1 (coord C15), SSD1_PWRDIS
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SSD1_PWRDIS_GPIO GPIO3               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_SSD1_PWRDIS_INIT_GPIO_VALUE 0U       /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_SSD1_PWRDIS_GPIO_PIN 1U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_SSD1_PWRDIS_GPIO_PIN_MASK (1U << 1U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SSD1_PWRDIS_PORT PORT3               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SSD1_PWRDIS_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SSD1_PWRDIS_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PORT3_2 (coord D15), SSD2_PWRDIS
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SSD2_PWRDIS_GPIO GPIO3               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_SSD2_PWRDIS_INIT_GPIO_VALUE 0U       /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_SSD2_PWRDIS_GPIO_PIN 2U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_SSD2_PWRDIS_GPIO_PIN_MASK (1U << 2U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SSD2_PWRDIS_PORT PORT3               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SSD2_PWRDIS_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SSD2_PWRDIS_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PORT3_6 (coord D17), SSD3_PWRDIS
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SSD3_PWRDIS_GPIO GPIO3               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_SSD3_PWRDIS_INIT_GPIO_VALUE 0U       /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_SSD3_PWRDIS_GPIO_PIN 6U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_SSD3_PWRDIS_GPIO_PIN_MASK (1U << 6U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SSD3_PWRDIS_PORT PORT3               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SSD3_PWRDIS_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SSD3_PWRDIS_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PORT3_7 (coord D14), CLK_SSD2_EN_N
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_CLK_SSD2_EN_N_GPIO GPIO3               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_CLK_SSD2_EN_N_INIT_GPIO_VALUE 1U       /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_CLK_SSD2_EN_N_GPIO_PIN 7U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_CLK_SSD2_EN_N_GPIO_PIN_MASK (1U << 7U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_CLK_SSD2_EN_N_PORT PORT3               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_CLK_SSD2_EN_N_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_CLK_SSD2_EN_N_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORT3_8 (coord E14), SSD5_PWRDIS
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SSD5_PWRDIS_GPIO GPIO3               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_SSD5_PWRDIS_INIT_GPIO_VALUE 0U       /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_SSD5_PWRDIS_GPIO_PIN 8U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_SSD5_PWRDIS_GPIO_PIN_MASK (1U << 8U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SSD5_PWRDIS_PORT PORT3               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SSD5_PWRDIS_PIN 8U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SSD5_PWRDIS_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PORT3_10 (coord F17), CLK_SSD3_EN_N
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_CLK_SSD3_EN_N_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_CLK_SSD3_EN_N_INIT_GPIO_VALUE 1U        /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_CLK_SSD3_EN_N_GPIO_PIN 10U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_CLK_SSD3_EN_N_GPIO_PIN_MASK (1U << 10U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_CLK_SSD3_EN_N_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_CLK_SSD3_EN_N_PIN 10U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_CLK_SSD3_EN_N_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                                               /* @} */

/*! @name PORT4_18 (coord N10), V_SSD2_DIS
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_V_SSD2_DIS_GPIO GPIO4                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_V_SSD2_DIS_INIT_GPIO_VALUE 0U        /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_V_SSD2_DIS_GPIO_PIN 18U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_V_SSD2_DIS_GPIO_PIN_MASK (1U << 18U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_V_SSD2_DIS_PORT PORT4                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_V_SSD2_DIS_PIN 18U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_V_SSD2_DIS_PIN_MASK (1U << 18U)      /*!<@brief PORT pin mask */
                                                            /* @} */

