NVIDIA/OpenSMA/src/boards/p3957/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SSD2_PRSNT_L_GPIO GPIO4                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_SSD2_PRSNT_L_GPIO_PIN 21U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_SSD2_PRSNT_L_GPIO_PIN_MASK (1U << 21U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SSD2_PRSNT_L_PORT PORT4                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SSD2_PRSNT_L_PIN 21U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SSD2_PRSNT_L_PIN_MASK (1U << 21U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORT4_22 (coord T12), SSD3_PRSNT_L
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SSD3_PRSNT_L_GPIO GPIO4                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_SSD3_PRSNT_L_GPIO_PIN 22U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_SSD3_PRSNT_L_GPIO_PIN_MASK (1U << 22U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SSD3_PRSNT_L_PORT PORT4                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SSD3_PRSNT_L_PIN 22U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SSD3_PRSNT_L_PIN_MASK (1U << 22U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORT2_4 (coord K3), CLK_SSD6_EN_N
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_CLK_SSD6_EN_N_GPIO GPIO2               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_CLK_SSD6_EN_N_INIT_GPIO_VALUE 1U       /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_CLK_SSD6_EN_N_GPIO_PIN 4U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_CLK_SSD6_EN_N_GPIO_PIN_MASK (1U << 4U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_CLK_SSD6_EN_N_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_CLK_SSD6_EN_N_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_CLK_SSD6_EN_N_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORT2_5 (coord K1), CLK_SSD7_EN_N
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_CLK_SSD7_EN_N_GPIO GPIO2               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_CLK_SSD7_EN_N_INIT_GPIO_VALUE 1U       /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_CLK_SSD7_EN_N_GPIO_PIN 5U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_CLK_SSD7_EN_N_GPIO_PIN_MASK (1U << 5U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_CLK_SSD7_EN_N_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_CLK_SSD7_EN_N_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_CLK_SSD7_EN_N_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORT2_6 (coord K2), CLK_SSD5_EN_N
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_CLK_SSD5_EN_N_GPIO GPIO2               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_CLK_SSD5_EN_N_INIT_GPIO_VALUE 1U       /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_CLK_SSD5_EN_N_GPIO_PIN 6U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_CLK_SSD5_EN_N_GPIO_PIN_MASK (1U << 6U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_CLK_SSD5_EN_N_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_CLK_SSD5_EN_N_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_CLK_SSD5_EN_N_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORT2_7 (coord L2), CLK_SSD4_EN_N
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_CLK_SSD4_EN_N_GPIO GPIO2               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_CLK_SSD4_EN_N_INIT_GPIO_VALUE 1U       /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_CLK_SSD4_EN_N_GPIO_PIN 7U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_CLK_SSD4_EN_N_GPIO_PIN_MASK (1U << 7U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_CLK_SSD4_EN_N_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_CLK_SSD4_EN_N_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_CLK_SSD4_EN_N_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORT5_5 (coord K12), CLKSEL_MODE
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_CLKSEL_MODE_GPIO GPIO5               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_CLKSEL_MODE_INIT_GPIO_VALUE 1U       /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_CLKSEL_MODE_GPIO_PIN 5U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_CLKSEL_MODE_GPIO_PIN_MASK (1U << 5U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_CLKSEL_MODE_PORT PORT5               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_CLKSEL_MODE_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_CLKSEL_MODE_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PORT5_6 (coord K13), V_SSD0_DIS
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_V_SSD0_DIS_GPIO GPIO5               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_V_SSD0_DIS_INIT_GPIO_VALUE 0U       /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_V_SSD0_DIS_GPIO_PIN 6U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_V_SSD0_DIS_GPIO_PIN_MASK (1U << 6U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_V_SSD0_DIS_PORT PORT5               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_V_SSD0_DIS_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_V_SSD0_DIS_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PORT5_7 (coord L13), V_SSD1_DIS
  @{ */

