NVIDIA/OpenSMA/src/boards/p3957/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_V_SSD1_DIS_GPIO GPIO5               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_V_SSD1_DIS_INIT_GPIO_VALUE 0U       /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_V_SSD1_DIS_GPIO_PIN 7U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_V_SSD1_DIS_GPIO_PIN_MASK (1U << 7U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_V_SSD1_DIS_PORT PORT5               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_V_SSD1_DIS_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_V_SSD1_DIS_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PORT1_0 (coord C6), VMON_12V_SSD1_DIV
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_VMON_12V_SSD1_DIV_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_VMON_12V_SSD1_DIV_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_VMON_12V_SSD1_DIV_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                                  /* @} */

/*! @name PORT1_1 (coord C5), VMON_12V_SSD2_DIV
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_VMON_12V_SSD2_DIV_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_VMON_12V_SSD2_DIV_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_VMON_12V_SSD2_DIV_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                                  /* @} */

/*! @name PORT1_3 (coord B4), VMON_12V_SSD3_DIV
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_VMON_12V_SSD3_DIV_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_VMON_12V_SSD3_DIV_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_VMON_12V_SSD3_DIV_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                                  /* @} */

/*! @name PORT1_4 (coord A4), VMON_12V_SSD4_DIV
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_VMON_12V_SSD4_DIV_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_VMON_12V_SSD4_DIV_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_VMON_12V_SSD4_DIV_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                                                  /* @} */

/*! @name PORT1_5 (coord B3), VMON_12V_SSD5_DIV
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_VMON_12V_SSD5_DIV_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_VMON_12V_SSD5_DIV_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_VMON_12V_SSD5_DIV_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                                                  /* @} */

/*! @name PORT4_15 (coord T8), VMON_12V_SSD6_DIV
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_VMON_12V_SSD6_DIV_PORT PORT4                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_VMON_12V_SSD6_DIV_PIN 15U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_VMON_12V_SSD6_DIV_PIN_MASK (1U << 15U)      /*!<@brief PORT pin mask */
                                                                   /* @} */

/*! @name PORT4_19 (coord R10), VMON_12V_SSD7_DIV
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_VMON_12V_SSD7_DIV_PORT PORT4                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_VMON_12V_SSD7_DIV_PIN 19U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_VMON_12V_SSD7_DIV_PIN_MASK (1U << 19U)      /*!<@brief PORT pin mask */
                                                                   /* @} */

/*! @name PORT5_0 (coord U16), PCIE_SSD0_PERST_L
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_PCIE_SSD0_PERST_L_GPIO GPIO5               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_PCIE_SSD0_PERST_L_GPIO_PIN 0U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_PCIE_SSD0_PERST_L_GPIO_PIN_MASK (1U << 0U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_PCIE_SSD0_PERST_L_PORT PORT5               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PCIE_SSD0_PERST_L_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PCIE_SSD0_PERST_L_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                                  /* @} */

/*! @name PORT5_1 (coord U17), PCIE_SSD1_PERST_L
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_PCIE_SSD1_PERST_L_GPIO GPIO5               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_PCIE_SSD1_PERST_L_GPIO_PIN 1U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_PCIE_SSD1_PERST_L_GPIO_PIN_MASK (1U << 1U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_PCIE_SSD1_PERST_L_PORT PORT5               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PCIE_SSD1_PERST_L_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PCIE_SSD1_PERST_L_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                                  /* @} */

/*! @name PORT5_4 (coord M12), PCIE_SSD2_PERST_L
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_PCIE_SSD2_PERST_L_GPIO GPIO5               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_PCIE_SSD2_PERST_L_GPIO_PIN 4U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_PCIE_SSD2_PERST_L_GPIO_PIN_MASK (1U << 4U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_PCIE_SSD2_PERST_L_PORT PORT5               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PCIE_SSD2_PERST_L_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PCIE_SSD2_PERST_L_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                                                  /* @} */

