NVIDIA/OpenSMA/src/boards/p3957/board/pin_mux.h
/*! @name PORT5_3 (coord N11), PCIE_SSD3_PERST_L
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_PCIE_SSD3_PERST_L_GPIO GPIO5               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_PCIE_SSD3_PERST_L_GPIO_PIN 3U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_PCIE_SSD3_PERST_L_GPIO_PIN_MASK (1U << 3U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_PCIE_SSD3_PERST_L_PORT PORT5               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PCIE_SSD3_PERST_L_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PCIE_SSD3_PERST_L_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                                  /* @} */

/*! @name PORT5_2 (coord M10), PCIE_SSD4_PERST_L
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_PCIE_SSD4_PERST_L_GPIO GPIO5               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_PCIE_SSD4_PERST_L_GPIO_PIN 2U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_PCIE_SSD4_PERST_L_GPIO_PIN_MASK (1U << 2U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_PCIE_SSD4_PERST_L_PORT PORT5               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PCIE_SSD4_PERST_L_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PCIE_SSD4_PERST_L_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                                  /* @} */

/*! @name PORT4_14 (coord N8), PCIE_SSD5_PERST_L
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_PCIE_SSD5_PERST_L_GPIO GPIO4                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_PCIE_SSD5_PERST_L_GPIO_PIN 14U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_PCIE_SSD5_PERST_L_GPIO_PIN_MASK (1U << 14U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_PCIE_SSD5_PERST_L_PORT PORT4                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PCIE_SSD5_PERST_L_PIN 14U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PCIE_SSD5_PERST_L_PIN_MASK (1U << 14U)      /*!<@brief PORT pin mask */
                                                                   /* @} */

/*! @name PORT4_16 (coord R8), PCIE_SSD6_PERST_L
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_PCIE_SSD6_PERST_L_GPIO GPIO4                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_PCIE_SSD6_PERST_L_GPIO_PIN 16U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_PCIE_SSD6_PERST_L_GPIO_PIN_MASK (1U << 16U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_PCIE_SSD6_PERST_L_PORT PORT4                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PCIE_SSD6_PERST_L_PIN 16U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PCIE_SSD6_PERST_L_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                                                   /* @} */

/*! @name PORT4_17 (coord R9), PCIE_SSD7_PERST_L
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_PCIE_SSD7_PERST_L_GPIO GPIO4                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_PCIE_SSD7_PERST_L_GPIO_PIN 17U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_PCIE_SSD7_PERST_L_GPIO_PIN_MASK (1U << 17U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_PCIE_SSD7_PERST_L_PORT PORT4                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PCIE_SSD7_PERST_L_PIN 17U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PCIE_SSD7_PERST_L_PIN_MASK (1U << 17U)      /*!<@brief PORT pin mask */
                                                                   /* @} */

/*! @name PORT3_22 (coord M16), VPP_CPU0B_ALERT
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_VPP_CPU0B_ALERT_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_VPP_CPU0B_ALERT_INIT_GPIO_VALUE 1U        /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_VPP_CPU0B_ALERT_GPIO_PIN 22U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_VPP_CPU0B_ALERT_GPIO_PIN_MASK (1U << 22U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_VPP_CPU0B_ALERT_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_VPP_CPU0B_ALERT_PIN 22U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_VPP_CPU0B_ALERT_PIN_MASK (1U << 22U)      /*!<@brief PORT pin mask */
                                                                 /* @} */

/*! @name PORT1_6 (coord B2), VPP_CPU1B_ALERT
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_VPP_CPU1B_ALERT_GPIO GPIO1               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_VPP_CPU1B_ALERT_INIT_GPIO_VALUE 1U       /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_VPP_CPU1B_ALERT_GPIO_PIN 6U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_VPP_CPU1B_ALERT_GPIO_PIN_MASK (1U << 6U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_VPP_CPU1B_ALERT_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_VPP_CPU1B_ALERT_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_VPP_CPU1B_ALERT_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                                /* @} */

/*! @name PORT0_17 (coord A10), SMB01_SCL
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SMB01_SCL_PORT PORT0                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SMB01_SCL_PIN 17U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SMB01_SCL_PIN_MASK (1U << 17U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PORT0_16 (coord B10), SMB01_SDA
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SMB01_SDA_PORT PORT0                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SMB01_SDA_PIN 16U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SMB01_SDA_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
